package com.example.quiz;

import androidx.appcompat.app.AppCompatActivity;
import androidx.cardview.widget.CardView;

import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import com.squareup.picasso.Picasso;

import java.util.ArrayList;
import java.util.HashMap;

public class MainActivity5 extends AppCompatActivity {


    ListView mylist;

    ArrayList<HashMap<String,String>>arrayList=new ArrayList<>();

    HashMap<String,String>hashMap;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main5);
        mylist=findViewById(R.id.mylist);



        Myhasmap();




    MyadAdapter myadAdapter=new MyadAdapter();

    mylist.setAdapter(myadAdapter);




    }


    private class MyadAdapter extends BaseAdapter{


        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int position) {
            return null;
        }

        @Override
        public long getItemId(int position) {
            return 0;
        }

        @Override
        public View getView(int position, View convertView, ViewGroup parent) {


            LayoutInflater layoutInflater= (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);

            View myview=layoutInflater.inflate(R.layout.item,parent,false);


            ImageView image=myview.findViewById(R.id.image);

            TextView tittle=myview.findViewById(R.id.tittle);

            TextView dis=myview.findViewById(R.id.dis);

         LinearLayout layout=myview.findViewById(R.id.layout);


            HashMap<String,String>hashMap=arrayList.get(position);

            String name=hashMap.get("name");

            String disc=hashMap.get("disc");

            String image_url=hashMap.get("image_url");



            tittle.setText(name);
           dis.setText(disc);


            Picasso.get()
                    .load(image_url)

                    .into(image);


            layout.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View v) {

         MainActivity6.TITTLE=name;
         MainActivity6.DISCRIPSHON=disc;


                    Bitmap bitmap=((BitmapDrawable)image.getDrawable()).getBitmap();

                    MainActivity6.My_Bitmap=bitmap;












                    startActivity(new Intent(MainActivity5.this,MainActivity6.class));

                }
            });
















            return myview;
        }
    }









    //mathod


         public void Myhasmap(){


        hashMap=new HashMap<>();
        hashMap.put("name","কাশ্মীরি স্টাইলে মুরগির মাংস! রইল রেসিপি");
        hashMap.put("disc","উপকরণ এক কেজি চিকেন, এক চামচ ঘি, আধা কাপ টক দই, আধা কাপ ময়দা, আধা কাপ দুধ, হলুদ গুঁড়ো, লঙ্কা গুঁড়ো, ধনে গুঁড়ো, জিরে গুঁড়ো, গরম মশলা গুঁড়ো, আদা বাটা, রসুন বাটা, পেঁয়াজ কুচি," +
                " টমেটো কুচি, স্বাদ অনুযায়ী লবণ, গোটা গরম মশলা, গোটা গোলমরিচ।প্রণালী মুরগির মাংস ভাল করে ধুয়ে জল ঝরিয়ে নিন। একটা বড় বাটিতে চিকেনের সঙ্গে টক দই, হলুদ গুঁড়ো, লঙ্কার গুঁড়ো, ধনে গুঁড়ো, জিরে গুঁড়ো," +
                " গরম মশলার গুঁড়ো, নুন, আদা বাটা ও রসুন বাটা মাখিয়ে ১৫-২০ মিনিট ম্যারিনেশনের জন্য রেখে দিন। কড়াইতে পরিমাণমতো ঘি গরম করে গোটা গরম মশলাগুলো ফোড়ন দিন। এতে পেঁয়াজ কুচি দিয়ে ভাজতে" +
                " থাকুন। পেঁয়াজ লালচে হলে টমেটো কুচি এবং অল্প নুন দিয়ে দিন। টমেটো নরম হয়ে এলে ম্যারিনেট করা রাখা মাংসটা দিয়ে দিন। পরিমাণমতো নুন দিয়ে মাংসটা ভাল করে কষাতে থাকুন। ঢাকা দিয়ে রান্না করুন। " +
                "মাঝেমাঝে ঢাকনা খুলে নাড়াচাড়া করবেন। মাংস কষাতে কষাতে তেল বেরোতে শুরু করলে এতে ময়দা মিশিয়ে দিন। আরও কিছুক্ষণ কষিয়ে নিয়ে কড়াইতে দুধ ঢেলে মিশিয়ে দিন। এর পর মাংসটা মিনিট দশেক ঢাকা দিয়ে রান্না করুন। " +
                "মাংস সেদ্ধ হয়ে গেলে এবং গ্রেভি ঘন হয়ে এলে নামিয়ে নিন। ভাত, পোলাও, নান, রুটি বা পরোটার সঙ্গে গরম-গরম পরিবেশন করুন কাশ্মীরি চিকেন মশলা।" );
        hashMap.put("image_url","https://bengali.boldsky.com/img/2023/09/kashmiri-chicken-recipe-1696080543.jpg");
        arrayList.add(hashMap);





             hashMap=new HashMap<>();
             hashMap.put("name","মুরগির মাংস দিয়েই তৈরি হবে সুস্বাদু ধোকার ডালনা! রইল প্রণালী");
             hashMap.put("disc","উপকরণ দেড় কাপ চিকেন কিমা, আধ কাপ ছোলার ডাল, হলুদ গুঁড়ো, লঙ্কা গুঁড়ো, গোটা জিরে, পেঁয়াজ কুচি, কয়েকটা কাঁচা লঙ্কা কুচি, আদা বাটা, রসুন বাটা, গরম মশলা গুঁড়ো, এক চামচ ঘি, রান্নার জন্য সর্ষে তেল। প্রণালী ছোলার ডাল জলে ধুয়ে বেশ কয়েক ঘণ্টা ভিজিয়ে রাখতে হবে। তারপর মিক্সিতে পিষে মিহি পেস্ট তৈরি করে নিন। চিকেন কিমা ভাল ভাবে ধুয়ে জল ঝরিয়ে রাখুন। এর পর মাংসের কিমার মধ্যে ডালের পেস্ট, হলুদ গুঁড়ো, লঙ্কা গুঁড়ো, নুন, চিনি দিয়ে ভাল করে মাখিয়ে নিন। কড়াইয়ে পরিমাণমতো সর্ষে তেল গরম করে গোটা জিরে ফোড়ন দিন। এতে পেঁয়াজ কুচি, কাঁচালঙ্কা কুচি দিয়ে খানিকক্ষণ নাড়াচাড়া করে চিকেন ও ডালের মিশ্রণটি দিয়ে দিন। ক্রমাগত নাড়তে থাকুন। ঢাকা দিয়ে মাংস সেদ্ধ করে নিন। শুকনো হয়ে এলে নামিয়ে ঠান্ডা হতে দিন। তারপর একটা বড় প্লেটে ঢেলে ধোকার আকারে কেটে নিন। কড়াইতে বেশি করে তেল গরম করে ধোকার টুকরোগুলি লালচে করে ভেজে তুলে রাখুন। ওই তেলেই গোটা গরম মশলা ফোড়ন দিন। ফোড়ন থেকে সুগন্ধ বেরোলে পেঁয়াজ কুচি, টম্যাটো কুচি দিয়ে ভাজুন। এর পর আদা বাটা, রসুন বাটা দিয়ে দিন। আদা রসুনের কাঁচা গন্ধ চলে গেলে হলুদ গুঁড়ো, লঙ্কার গুঁড়ো, নুন, চিনি এবং সামান্য জল দিয়ে মশলা কষিয়ে নিন। মশলা থেকে তেল ছেড়ে এলে পরিমাণমতো জল দিয়ে ঢাকা দিয়ে দিন। মিনিট পাঁচেক পর ঝোল ফুটে উঠলে ভেজে রাখা চিকেন ধোকাগুলি দিয়ে দিন। আবার ঢাকা দিন। রান্নাটা মাখা মাখা হলে ভাল। তাই বেশি ঝোল রাখবেন না। নামানোর আগে উপর থেকে ঘি ছড়িয়ে দিন। সাদা ভাতের সঙ্গে গরম গরম পরিবেশন করুন চিকেন ধোকার ডালনা।");
             hashMap.put("image_url","https://bengali.boldsky.com/img/2023/09/chicken-dhoka-recipe-1696000825.jpg");
             arrayList.add(hashMap);




             hashMap=new HashMap<>();
             hashMap.put("name","চায়ের আড্ডায় সঙ্গী হতেই পারে আলু পিঁয়াজের কচুরি, দেখে নিন রেসিপি");
             hashMap.put("disc", "উপকরণ ময়দা ২ কাপ, স্বাদ অনুযায়ী লবণ ও চিনি, গোটা ধনে, গোটা জিরা, গোটা মৌরি, রসুন কুচি, পেঁয়াজ কুচি, কাঁচা লঙ্কা কুচি, ৪ টেবিল চামচ বেসন, ১ চা চামচ শুকনো লঙ্কাগুঁড়ো, ১ চা চামচ চাট মশলা, পাতিলেবুর রস, ২টো আলু সেদ্ধ মাখা, এক চিমটি হিং, পরিমাণমতো সাদা তেল বা ঘি।" );
             hashMap.put("image_url","https://bengali.boldsky.com/img/2023/09/kachori-recipe-1695914126.jpg");
             arrayList.add(hashMap);



             hashMap=new HashMap<>();
             hashMap.put("name","ঝটপট বানিয়ে ফেলুন সুস্বাদু প্যানকেক");
             hashMap.put("disc", "প্যানকেকের উপকরণ এক কাপ ওটস, ২টো কলা, একটি ডিম, আধা কাপ দুধ, এক চা চামচ বেকিং পাউডার, ২ টেবিল চামচ সাদা তেল, ১ চা চামচ ভ্যানিলা এসেন্স, ৩ টেবিল চামচ ম্যাপেল সিরাপ, ২ টেবিল চামচ মিল্ক চকোলেট, ১ টেবিল চামচ আখরোট কুচি।প্যানকেক তৈরির পদ্ধতি মিক্সিতে খোসা ছাড়ানো কলা, দুধ, ডিম, ওটস, ভ্যানিলা এসেন্স এবং ম্যাপেল সিরাপ - সব একসঙ্গে মিহি করে পিষে নিন। একেবারে মিহি ব্যাটার তৈরি করতে হবে। এবার একটি পাত্রে এই ব্যাটার ঢেলে তাতে বেকিং পাউডার মিশিয়ে নিন। গ্যাসে নন-স্টিক প্যান বসান। তাতে অল্প তেল দিয়ে গরম হতে দিন। তেল গরম হলে প্যানে এক হাতা ব্যাটার দিয়ে গোল করে চারপাশে ছড়িয়ে দিন। একদিন ভাল ভাবে ভাজা হয়ে গেলে, আরেক পিঠ উল্টে দিন। এই ভাবে উল্টেপাল্টে দুই দিক গোল্ডেন ব্রাউন করে ভেজে নিন। অন্য একটি প্যানে মিল্ক চকোলেট নিয়ে গলিয়ে নিন ভাল ভাবে। প্লেটে প্যানকেকগুলি একটার ওপর একটা সাজিয়ে নিন। তার উপর আখরোট কুচি এবং গলানো চকোলেট ছড়িয়ে দিন। ম্যাপেল সিরাপ বা মধু সহযোগে পরিবেশন করুন কলা ওটস প্যানকেক।");
             hashMap.put("image_url","https://bengali.boldsky.com/img/2023/09/banana-oats-pancake-recipe-1695821246.jpg");
             arrayList.add(hashMap);



             hashMap=new HashMap<>();
             hashMap.put("name","চায়ের সঙ্গে স্বাস্থ্যকর ‘টা’ হতে পারে লেমন কর্ন, দেখে নিন রেসিপি");
             hashMap.put("disc", "কয়লার আঁচে পুড়িয়ে সামান্য নুন-লেবু মাখিয়ে দুর্দান্ত খেতে লাগে ভুট্টা। তবে ভুট্টা মানেই তো পোড়া, পপকর্ন অথবা সেদ্ধ নয়। চায়ের আসরে ভুট্টা দিয়ে বানিয়ে ফেলতে পারেন স্বাস্থ্যকর অথচ মুখরোচক খাবার লেমন কর্ন। দেখে নিন রেসিপি।লেমন কর্ন তৈরির উপকরণ ২৫০ গ্রাম ভুট্টা, ১ চা চামচ ওরেগানো, ২ টেবিল চামচ পাতিলেবুর রস, পরিমাণমতো জল, ২ টেবিল চামচ কর্ন ফ্লাওয়ার, ১ চা চামচ পেপরিকা, পরিমাণমতো গোলমরিচ গুঁড়ো, স্বাদ অনুযায়ী লবণ, পরিমাণমতো সাদা তেল। লেমন কর্ন তৈরির পদ্ধতি ভুট্টাগুলি নুন জলে সিদ্ধ করে নিন খানিকক্ষণ। তারপর গরম জল ঝরিয়ে নিয়ে ঠাণ্ডা জলে সেদ্ধ ভুট্টা ধুয়ে ফেলুন। ভাল ভাবে জল ঝরিয়ে একটা পাত্রে রাখুন। একটা বাটিতে কর্ন ফ্লাওয়ার, পাতিলেবুর রস, ওরেগানো, পেপরিকা, গোলমরিচ গুঁড়ো, স্বাদ অনুযায়ী লবণ এবং অল্প জল দিয়ে ভাল করে ফেটিয়ে নিন। এই মিশ্রণে সেদ্ধ ভুট্টা মিশিয়ে নিন। ফ্রাইং প্যানে তেল গরম করতে বসান। তেল ভাল মতো গরম হলে ভুট্টাগুলো দিয়ে দিন। গোল্ডেন ব্রাউন রঙ না হওয়া পর্যন্ত ভাজুন। ভাজা হয়ে গেলে তেল ঝরিয়ে টিস্যু পেপারে তুলে নিন। টিস্যু পেপার ভুট্টার অতিরিক্ত তেল শুষে নেবে। একটা পাত্রে ভাজা ভুটাগুলো সাজিয়ে নিন। এর উপরে পাতিলেবুর রস ও লবণ ছড়িয়ে গরম গরম পরিবেশন করুন। এর সঙ্গে পেঁয়াজ স্লাইস করে কেটেও দিতে পারেন। ফ্রাইং প্যানে তেল গরম করতে বসান। তেল ভাল মতো গরম হলে ভুট্টাগুলো দিয়ে দিন। গোল্ডেন ব্রাউন রঙ না হওয়া পর্যন্ত ভাজুন। ভাজা হয়ে গেলে তেল ঝরিয়ে টিস্যু পেপারে তুলে নিন। টিস্যু পেপার ভুট্টার অতিরিক্ত তেল শুষে নেবে। একটা পাত্রে ভাজা ভুটাগুলো সাজিয়ে নিন। এর উপরে পাতিলেবুর রস ও লবণ ছড়িয়ে গরম গরম পরিবেশন করুন। এর সঙ্গে পেঁয়াজ স্লাইস করে কেটেও দিতে পারেন।");
             hashMap.put("image_url","https://bengali.boldsky.com/img/2023/09/lemon-corn-1695738934.jpg");

             arrayList.add(hashMap);






             hashMap=new HashMap<>();
             hashMap.put("name"," চিকেনের এই পদ একবার খেলে ভুলতে পারবেন না! রইল রেসিপি");
             hashMap.put("disc", "আজ আমরা এক অন্য ধরনের মাংসের রেসিপি সম্পর্কে বলব। একেবারে অল্প তেল মশলায় বানিয়ে ফেলুন 'চিকেন মালাই হান্ডি'। এই খাবারের যেমন স্বাদ, তেমন পুষ্টিতেও ভরপুর। উপকরণ ৫০০ গ্রাম মুরগির মাংস, ৪ টেবিল চামচ আদা-রসুন বাটা, ২ টেবিল চামচ পেঁয়াজ বাটা, ৪ টা পেঁয়াজের কুচি, ১/৪ চা চামচ সাদা গোলমরিচ গুঁড়া, ১/৪ চা চামচ কালো গোলমরিচ গুঁড়া, ৩ টেবিল চামচ টক দই, ২ টেবিল চামচ ফ্রেশ ক্রিম, ১ টেবিল চামচ কাজুবাদাম বাটা, ১ চা চামচ পোস্ত বাটা, প্রয়োজনমতো সবুজ লঙ্কা বাটা, ২-৩ টা তেজপাতা, ৩ টা সবুজ এলাচ, ৩ টা লবঙ্গ, ১ টুকরো দারুচিনি, ১ চা চামচ শুকনো মেথি পাতা, ১/৪ চা চামচ ধনেপাতা গুঁড়া, ১/৪ চা চামচ জিরা গুঁড়া, পরিমান মতো সাদা তেল, নুন, হলুদ ও গরম জল। প্রণালী প্রথমেই পরিমান মতো মাংসে নুন, আদা-রসুন বাটা, দই, আর গোলমরিচ দিয়ে একসঙ্গে ম্যারিনেট করে অন্তত ২৫-৩০ মিনিট রাখুন। এবার কড়াই গরম করে পরিমান মতো তেল দিন। তেল গরম হলে তেজপাতা, এলাচ, লবঙ্গ, দারুচিনি, পেঁয়াজ কুচি দিয়ে দিন। পেঁয়াজ হালকা ভাজা হলে আদা-রসুন বাটা দিয়ে ৫ মিনিট নাড়ুন। ম্যারিনেট করা মাংস কড়াইতে ঢেলে ভালো করে কষতে থাকুন। তারপর মেথি পাতা, ধনেপাতা গুঁড়া, জিরা গুঁড়া, লঙ্কা বাটা দিয়ে ভালো করে কড়াইতে মিক্স করে নিন। এবার পরিমান মতো গরম জল দিয়ে ৫ মিনিট চাপা দিন। পাঁচ মিনিট পর ২ টেবিল চামচ দই, কাজুবাদাম বাটা, পোস্ত বাটা, দিয়ে ভালো করে মিক্স করে চাপা দিয়ে দিন। মাংস সেদ্ধ হয়ে এলে তাতে ২ টেবিল চামচ ফ্রেশ ক্রিম দিয়ে ভালো করে ফুটিয়ে নিন। ৫-১০ মিনিট পর নামিয়ে নিন। তৈরী আপনার 'চিকেন মালাই হান্ডি'। সুন্দর করে প্লেটে নামিয়ে তার উপর ফ্রেশ ক্রিম ও ধোনে পাতা দিয়ে পরিবেশন করুন।");
             hashMap.put("image_url","https://bengali.boldsky.com/img/2023/09/chicken-malai-handi-recipe-1695658093.jpg");

             arrayList.add(hashMap);




             hashMap=new HashMap<>();
             hashMap.put("name"," ফুলকপির এই পদ একবার খেলে মুখে লেগে থাকবে! রইল রেসিপি");
             hashMap.put("disc","উপকরণ একটা ফুলকপি, একটা ক্যাপসিকাম কুচি, একটা পেঁয়াজ কুচি, আদা কুচি, রসুন কুচি, কর্ন ফ্লাওয়ার, গোলমরিচ গুঁড়ো, গোটা মৌরি, ড্রাই ম্যাঙ্গো পাউডার, আধ কাপ ময়দা, হলুদ গুঁড়ো সামান্য, গোটা জিরা, ধনে গুঁড়ো, টমেটো সস, স্বাদ অনুযায়ী লবণ, পরিমাণমতো তেল। তৈরির পদ্ধতি ফুলকপি ছোটো ছোটো করে কেটে জলে ধুয়ে ফেলুন। কড়াইতে জল ও নুন দিয়ে ফুলকপি ভাপিয়ে নিন। তারপর জলটা ছেঁকে নিয়ে ফুলকপির ওপর ঠাণ্ডা জল ঢেলে ধুয়ে ফেলুন। অতিরিক্ত জল ঝরিয়ে নেবেন। একটি পাত্রে ময়দা, কর্ন ফ্লাওয়ার, গোলমরিচ গুঁড়ো, হলুদ গুঁড়ো এবং নুন একসঙ্গে মিশিয়ে নিন। এতে পরিমাণমতো জল দিয়ে ব্যাটার তৈরি করুন। ব্যাটার যেন খুব বেশি ঘন বা পাতলা না হয়। এই ব্যাটারে ভাপানো ফুলকপি দিয়ে নাড়াচাড়া করে মিশিয়ে নিন। কড়াইতে তেল গরম করে একে একে সবকটা ফুলকপির টুকরো ছাড়তে থাকুন। গোল্ডেন ব্রাউন রঙ করে ভেজে নিন ফুলকপিগুলো। ফ্রাইং প্যানে অল্প তেল গরম করে গোটা জিরা ও মৌরি ফোড়ন দিন। এতে পেঁয়াজ কুচি দিয়ে ভাজতে থাকুন। পেঁয়াজের রঙ লালচে হলে আদা ও রসুন কুচি দিয়ে দিন। তারপর ক্যাপসিকাম কুচি দিন। সমস্ত উপকরণ ভেজে নিন ভাল ভাবে। এতে ধনে গুঁড়ো, ম্যাঙ্গো পাউডার, হলুদ গুঁড়ো, গোলমরিচ গুঁড়ো এবং স্বাদ অনুযায়ী লবণ দিয়ে নাড়াচাড়া করুন খানিকক্ষণ। এর পর এতে টমেটো সস দিয়ে ভাল ভাবে মেশান। July 2023 Planet Transit: একাধিক গ্রহের রাশি পরিবর্তন হবে অক্টোবরে, শুভ প্রভাব পড়বে ৬ রাশির উপর! এই মশলায় দিয়ে দিন ভেজে রাখা ফুলকপিগুলো। মিনিট দুয়েক মশলার সঙ্গে নেড়েচেড়ে রান্না করে নামিয়ে নিন। গরম গরম পরিবেশন করুন।");

             hashMap.put("image_url","https://bengali.boldsky.com/img/2023/09/gobi-pepper-fry-recipe-1695391422.jpg");

             arrayList.add(hashMap);





             hashMap=new HashMap<>();
             hashMap.put("name"," ঢ্যাঁড়শ এ ভাবে রান্না করলে বাড়ির সবাই খাবে চেটেপুটে! রইল রেসিপি");
             hashMap.put("disc","আজ আপনাদের জন্য ঢ্যাঁড়শের এমন পদের সন্ধান আমরা নিয়ে এসেছি যা চেটেপুটে খাবে বাড়ির সকলে। বেসন এবং কিছু সামান্য মশলা দিয়েই বানানো যায় ঢ্যাঁড়শের এই পদ। চলুন দেখে নেওয়া যাক রেসিপি। বেসন ভিন্ডির উপকরণ ২৫০ গ্রাম ঢ্যাঁড়শ, পরিমাণমতো বেসন, এক চিমটি হিং, আধা চামচ গোটা জিরে, সামান্য হলুদ গুঁড়ো, ধনে গুঁড়ো, আমচুর পাউডার, পাতিলেবুর রস, পরিমাণমতো লঙ্কা গুঁড়ো, স্বাদ অনুযায়ী লবণ, রান্নার জন্য সাদা তেল। বেসন ভিন্ডি তৈরির পদ্ধতি ঢ্যাঁড়শ ভাল করে ধুয়ে জল ঝরিয়ে নিন। ঢ্যাঁড়শের মাথা এবং লেজ কেটে বাদ দিয়ে মাঝখান থেকে লম্বা করে চিরে দু'টুকরো করে নিন। কড়াইতে তেল গরম করে ঢ্যাঁড়শগুলো দিয়ে হালকা ভেজে নিন। ঢ্যাঁড়শ ভাজা হয়ে গেলে তুলে রাখুন। কড়াইতে আরও একটু তেল দিয়ে হিং ও গোটা জিরে ফোড়ন দিন। ফোড়ন থেকে সুন্দর গন্ধ বেরোলে এতে বেসন দিয়ে দিন। নাড়াচাড়া করে ভাজতে থাকুন। খানিকক্ষণ পর বেসনে বাদামী রং ধরলে এবং সুগন্ধ বেরোলে এতে লঙ্কা গুঁড়ো, ধনে গুঁড়ো, হলুদ গুঁড়ো ও নুন দিয়ে রান্না করুন। কিছুক্ষণ পর কড়াইতে ভেজে রাখা ঢ্যাঁড়শগুলো দিয়ে দিন। এতে আমচুর পাউডারও মিশিয়ে দিন। সমস্ত উপকরণ একসঙ্গে ভাল ভাবে নাড়াচাড়া করুন। বেসন ও মশলার সঙ্গে ঢ্যাঁড়শ সম্পূর্ণরূপে মিশে যাওয়া অবধি নাড়তে থাকুন। প্রয়োজনে এতে অল্প জলও মেশাতে পারেন। ঢাকা দিয়ে ঢ্যাঁড়শগুলো সেদ্ধ করে নিন। রান্না হয়ে গেলে সবশেষে উপর থেকে লেবুর রস ছড়িয়ে ভাল ভাবে মিশিয়ে নামিয়ে নিন। রুটি বা পরোটার সঙ্গে গরম গরম পরিবেশন করুন বেসন ভিন্ডি!");
             hashMap.put("image_url","https://bengali.boldsky.com/img/2023/09/besan-bhindi-recipe-1695303546.jpg");
             arrayList.add(hashMap);












         }





}